data_generation/simulation_results/of/case_44/constant/simParams
nIter 2000;
hComponent0 583.9394562723243;
hComponent1 1208.800138462186;
hComponent2 853.8037582341319;
hComponent3 927.9995242056734;
hComponent4 872.4302917020017;kComponent0 62.02643647251787;
kComponent1 72.31397444614662;
kComponent2 51.55883516182459;
kComponent3 91.53435743836106;
kComponent4 51.85905212315;
tAmbient 300;
Ux 0.8906044669204205;
kPCB 0.3142538432174916;